/* env. variable value template */
"value" = "Gwerth";

/* env. variable name template */
"SOME_ENV" = "SOME_ENV";

/* toolbar item name */
"New" = "Newydd";

/* toolbar item tooltip */
"Add new environment variable" = "Adio newidyn amgylcheddol newydd";

/* toolbar item tooltip */
"Remove environment variable" = "Dileu newidyn amgylcheddol";

/* toolbar item name */
"Delete" = "Dileu";

/* open failure alert sheet
   write failure alert sheet
   write failure alert sheet */
"Failure" = "Methiant";

/* Insert program std file open dialog: alternative label for open button */
"Insert" = "Mewnforiwch";

/* Unsaved data alert sheet title */
"Unsaved Data" = "Data heb ei safio";

/* unsaved changes warning in alert sheet
   descriptive text in save changes alert sheet */
"You have modified your crontab. Save changes?" = "Rydych wedi newid eich crontab. Safio'r newidiadau?";

/* discard in dialog
   Discard chanes button label */
"Discard" = "Anghofio";

/* empty crontab alert sheet */
"Empty Crontab" = "Gwacio'r Crontab";

/* Ok in dialog */
"OK" = "Iawn";

/* descriptive text in generic failure alert sheet. Try to get fatalism and ignorance across in translation... */
"Something prevented me from reading your crontab - maybe some ion storm in the asteroid belt. See if it's that and fix it or otherwise mail the author (see the About box) and complain like there's no tomorrow." = "Wnaeth rhywbeth fy atal rhag darllen eich crontab - efallai rhyw ion yn yr asteroid belt. Gwyriwch os taw hwnna yw e, neu e-bostiwch yr awdur (gwelwch y bocs wybodaeth)";

/* Information text displayed in the runNowPanel */
"Running command\n" = "Running command\n";

/* Cancel in dialog
   Cancel in dialogs */
"Cancel" = "Cansl";

/* descriptive text in open failure alert sheet
   descriptive  text in write failure alert sheet */
"Insufficient privileges to write crontab for user \"%s\"." = "Hawliau annerbynniol i ysgrifennu'r crontab am defnyddiwr \"%s\".";

/* run now menu item label. Has to be identical to the NIB version! */
"Run Now" = "Rhedeg Nawr";

/* Save button label */
"Save" = "Safio";

/* Home directory not found warning in open failure alert sheet */
"I couldn't find a home directory for '%s' on your system. Maybe you mistyped the name or (god no!) deleted the directory. Better have look..." = "Methais ffeindio ffowlder cartref ar gyfer '%s' ar eich system. Efallai sillafoch yr enw'n anghywir, neu, (annwyl ddyw!) ei ddileu. Well checio...";

/* default command for new crontab tasks */
"echo \"Happy New Year!\"" = "echo \"Blwyddyn Newydd Dda!\"";

/* Run now context menu item */
"Run now" = "Rhedeg nawr";

/* Show toolbar menu item label */
"Show Toolbar" = "Dangos y bar weithio ("Toolbar")";

/* Column title for extra column in system crontab. Generated programmatically (i.e. not in a nib) with width: 50 */
"User" = "Defnyddiwr";

/* user doesn't exist warning in open failure alert sheet */
"User does not exist" = "Dydy'r defnyddiwr ddim yn bodoli";

/* descriptive text in empty crontab alert sheet (make sure translations preserve the sarcastic tone ;-) */
"The system returned an empty crontab for '%s'. This probably just means that there's no crontab for this user yet. Pressing OK will allow you to edit and install a new crontab and you will never see this alert sheet again. If, however, you are sure that '%s' does have a crontab, then you may have encountered an temporal anomaly. Contact the author (see the About box) and complain like there's no tomorrow." = "Mae'r system wedi dangos crontab wâg ar gyfer '%s'. Fel arfer mae hyn yn golygu fod ddim crontab gan y defnyddiwr yna eto. Fydd gwasgu Iawn yn eich galluogi i olygu a chreu crontab newydd, ac fe welwch chi fyth mo'r neges yma eto. Ond, os rydych yn siwr fod gan '%s' crontab, mae'n bosib eich fod wedi ffeindio gwall yn y rhaglen. Cysylltwch a'r awdur (gwelwch y bocs wybodaeth) a chwynwch fel does ddim yfori.";

/* Insufficient privileges warning in open failure alert sheet */
"Insufficient privileges to open crontab for user \"%s\".\nOnly \"root\" can open other user's crontabs." = "Hawliau annerbynniol ar gyfer defnyddiwr \"%s\".\n \"root\" Yn unig sy'n gallu agor crontabs pobol eraill.";

/* descriptive text in open failure alert sheet
   descriptive  text in write failure alert sheet */
"Insufficient privileges to write crontab." = "Hawliau annerbynniol i ysgrifennu crontab.";

/* Information text displayed in the runNowPanel */
"\nThe output will appear below when the command has finished executing\n" = "\nFydd yr allbwn yn ymddangos isod pan mae'r orchymyn wedi gorffen digwydd\n";

/* Yes in dialog */
"Yes" = "Ie";

/* Hide toolbar menu item label */
"Hide Toolbar" = "Cuddio'r bar-weithio ("Toolbar")";

/* string in status toolbar item */
"Crontab for user:" = "Crontab i ddefnyddiwr:";

/* toolbar palette label
   toolbar label
   toolbar item tooltip */
"Current crontab" = "Crontab presennol";

/* toolbar item name */
"New" = "Newydd";

/* toolbar item name */
"Open" = "Agor";

/* toolbar item tooltip */
"Create new crontab entry" = "Creu cofnod crontab newydd";

/* toolbar item tooltip */
"Open crontab for different user" = "Agor crontab am ddefnyddiwr wahanol";

/* toolbar item name */
"Save" = "Safio";

/* toolbar item tooltip */
"Save crontab" = "Safio crontab";

/* toolbar item tooltip */
"Remove crontab entry" = "Dileu cofnod crontab";

/* toolbar item name */
"Delete" = "Dileu";

/* Error converting */
"Couldn't convert value" = "Ddim yn gallu trosglwyddo gwerth";

/* new version available dialog text */
"There's a new version available at %@.\n\nChanges in version %@:\n" = "Mae yna fersiwn newydd ar gael ar %@.\n\nNewidiadau mewn fersiwn %@:\n";

/* no new version available dialog text */
"There's no new version available." = "Nid oes fersiwn newydd ar gael.";

/* confirmation button title in 'no update available' dialog */
"Too bad" = "Dyna fywyd";

/* Update available alert sheet title */
"Update Available" = "Lan-ddât ar gael!";

/* update check connection failure dialog text */
"Someone tripped over the wire to the internet. Or maybe it's the rain. Wait for clear skies and try again." = "Wnaeth rhywyn cwympo drosto'r wifren i'r wê. Neu efallai'r glaw yw e. Arhoswch i'r gymylau glirio a thriwch eto.";

/* toolbar item tooltip */
"Run task now" = "Rhedeg tasg nawr";

/* go to download page button title in 'update available' dialog */
"Go to download page" = "Ewch i'r tudalen lawr-lwytho";

/* Edit task dialog submit button text */
"Apply" = "Setio";

/* toolbar item name */
"Edit" = "Golygu";

/* toolbar item tooltip */
"Edit task" = "Golygu Tasg";

/* no new version available dialog text */
"There's no new version available." = "Nid oes fersiwn newydd ar gael.";

/* No update available alert sheet title */
"No Update Available" = "Nid oes lan-ddat ar gael";

/* Check for update connection failure acknowledgement button title */
"Bummer" = "Cachi";

/* Home directory not found warning in open failure alert sheet */
"I couldn't find a home directory for '%@' on your system. Maybe you mistyped the name or (god no!) deleted the directory. Better have look..." = "Allaf ddim ffeindio ffowlder ar gyfer '%@' ar eich system. Efallai teipioch chi'r enw'n anghywir, neu (Duw annwyl!) dileu'r ffowlder. Well i chi checio...";

